src/main/java/br/com/infotera/it/tboholiday/newXMLDocument.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Credentials xmlns="http://TekTravel/HotelBookingApi" UserName="InfoteraTest" Password="Inf@64890970"/>
    </soap:Header>
    <soap:Body>
        <HotelBookRequest xmlns="http://TekTravel/HotelBookingApi">
            <ClientReferenceNumber>230420172946000#TBOH</ClientReferenceNumber>
            <GuestNationality>BR</GuestNationality>
            <Guests>
                <Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>MIRU</FirstName>
                    <LastName>OLIVEIRA</LastName>
                    <Age>39</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Adult" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>AMELIA</FirstName>
                    <LastName>MONTEIRO</LastName>
                    <Age>39</Age>
                </Guest>
            </Guests>
            <PaymentInfo VoucherBooking="true" PaymentModeType="Limit"/>
            <SessionId>d892ad79-6c8b-490a-8713-a3532cface9a</SessionId>
            <NoOfRooms>1</NoOfRooms>
            <ResultIndex>1</ResultIndex>
            <HotelCode>1246193</HotelCode>
            <HotelName>Ibis Fujairah</HotelName>
            <HotelRooms>
                <HotelRoom>
                    <RoomIndex>1</RoomIndex>
                    <RoomTypeName>1x Standard Room 1 Double</RoomTypeName>
                    <RoomTypeCode>3076891|27b57490-6edd-0d37-306e-1b2eccb984c2|1^^1^^2831186||27b57490-6edd-0d37-306e-1b2eccb984c2</RoomTypeCode>
                    <RatePlanCode>2831186||27b57490-6edd-0d37-306e-1b2eccb984c2</RatePlanCode>
                    <RoomRate RoomFare="30.91" RoomTax="7.88" TotalFare="38.78"/>
                </HotelRoom>
            </HotelRooms>
            <RestrictDuplicateBooking>true</RestrictDuplicateBooking>
        </HotelBookRequest>
    </soap:Body>
</soap:Envelope>
